In [1]:
import pandas as pd
import numpy as np

In [2]:
date = pd.read_csv('orders.csv')

In [3]:
time = pd.read_csv('messages.csv')

In [4]:
date

           date  product_id  city_id  orders
0    2019-12-10        5628       25       3
1    2018-08-15        3646       14     157
2    2018-10-23        1859       25       1
3    2019-08-17        7292       25       1
4    2019-01-06        4344       25       3
..          ...         ...      ...     ...
995  2018-10-08         255       13       1
996  2018-12-06        5521        7       1
997  2019-05-07         487       26      14
998  2019-03-03        1503       21       2
999  2019-10-15        6371        7      22

[1000 rows x 4 columns]

In [5]:
time

                    date                                                msg
0    2013-12-15 00:50:00                           ищу на сегодня мужика 37
1    2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2    2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3    2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4    2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше
..                   ...                                                ...
995  2012-03-16 00:50:00     ПАРЕНЬ СДЕЛАЕТ  МАССАЖ ЖЕНЩИНАМ -066-877-32-44
996  2014-01-23 23:14:00            сельский п 23 ищу девушку для отношений
997  2012-10-15 23:37:00  Д+Д ДЛЯ серьезных отношений. Мой номер 093-156...
998  2012-06-21 23:34:00  7 ДНЕПР М.34 ПОЗ.С Д/Ж ДЛЯ ВСТРЕЧ.Т.098 809 15 14
999  2014-06-19 23:25:00          Парень поласкает девушке...  т.0662035584

[1000 rows x 2 columns]

In [6]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [7]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

Working on Date

In [9]:
date

           date  product_id  city_id  orders
0    2019-12-10        5628       25       3
1    2018-08-15        3646       14     157
2    2018-10-23        1859       25       1
3    2019-08-17        7292       25       1
4    2019-01-06        4344       25       3
..          ...         ...      ...     ...
995  2018-10-08         255       13       1
996  2018-12-06        5521        7       1
997  2019-05-07         487       26      14
998  2019-03-03        1503       21       2
999  2019-10-15        6371        7      22

[1000 rows x 4 columns]

In [11]:
date.date = pd.to_datetime(date.date)

In [13]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

In [14]:
date['year'] = date.date.dt.year

In [15]:
date

          date  product_id  city_id  orders  year
0   2019-12-10        5628       25       3  2019
1   2018-08-15        3646       14     157  2018
2   2018-10-23        1859       25       1  2018
3   2019-08-17        7292       25       1  2019
4   2019-01-06        4344       25       3  2019
..         ...         ...      ...     ...   ...
995 2018-10-08         255       13       1  2018
996 2018-12-06        5521        7       1  2018
997 2019-05-07         487       26      14  2019
998 2019-03-03        1503       21       2  2019
999 2019-10-15        6371        7      22  2019

[1000 rows x 5 columns]

In [17]:
date['month'] = date.date.dt.month

In [18]:
date['day'] = date.date.dt.day

In [19]:
date

          date  product_id  city_id  orders  year  month  day
0   2019-12-10        5628       25       3  2019     12   10
1   2018-08-15        3646       14     157  2018      8   15
2   2018-10-23        1859       25       1  2018     10   23
3   2019-08-17        7292       25       1  2019      8   17
4   2019-01-06        4344       25       3  2019      1    6
..         ...         ...      ...     ...   ...    ...  ...
995 2018-10-08         255       13       1  2018     10    8
996 2018-12-06        5521        7       1  2018     12    6
997 2019-05-07         487       26      14  2019      5    7
998 2019-03-03        1503       21       2  2019      3    3
999 2019-10-15        6371        7      22  2019     10   15

[1000 rows x 7 columns]

In [22]:
date['month_name'] = date.date.dt.month_name()

In [23]:
date

          date  product_id  city_id  orders  year  month  day month_name
0   2019-12-10        5628       25       3  2019     12   10   December
1   2018-08-15        3646       14     157  2018      8   15     August
2   2018-10-23        1859       25       1  2018     10   23    October
3   2019-08-17        7292       25       1  2019      8   17     August
4   2019-01-06        4344       25       3  2019      1    6    January
..         ...         ...      ...     ...   ...    ...  ...        ...
995 2018-10-08         255       13       1  2018     10    8    October
996 2018-12-06        5521        7       1  2018     12    6   December
997 2019-05-07         487       26      14  2019      5    7        May
998 2019-03-03        1503       21       2  2019      3    3      March
999 2019-10-15        6371        7      22  2019     10   15    October

[1000 rows x 8 columns]

In [24]:
date['day_name'] = date.date.dt.day_name()

In [25]:
date

,date,product_id,city_id,orders,year,month,day,month_name,day_name
0,2019-12-10,5628,25,3,2019,12,10,December,Tuesday
1,2018-08-15,3646,14,157,2018,8,15,August,Wednesday
2,2018-10-23,1859,25,1,2018,10,23,October,Tuesday
3,2019-08-17,7292,25,1,2019,8,17,August,Saturday
4,2019-01-06,4344,25,3,2019,1,6,January,Sunday
...,...,...,...,...,...,...,...,...,...
995,2018-10-08,255,13,1,2018,10,8,October,Monday
996,2018-12-06,5521,7,1,2018,12,6,December,Thursday
997,2019-05-07,487,26,14,2019,5,7,May,Tuesday
998,2019-03-03,1503,21,2,2019,3,3,March,Sunday
999,2019-10-15,6371,7,22,2019,10,15,October,Tuesday

In [26]:
date['day_of_week'] = date.date.dt.dayofweek

In [27]:
date

,date,product_id,city_id,orders,year,month,day,month_name,day_name,day_of_week
0,2019-12-10,5628,25,3,2019,12,10,December,Tuesday,1
1,2018-08-15,3646,14,157,2018,8,15,August,Wednesday,2
2,2018-10-23,1859,25,1,2018,10,23,October,Tuesday,1
3,2019-08-17,7292,25,1,2019,8,17,August,Saturday,5
4,2019-01-06,4344,25,3,2019,1,6,January,Sunday,6
...,...,...,...,...,...,...,...,...,...,...
995,2018-10-08,255,13,1,2018,10,8,October,Monday,0
996,2018-12-06,5521,7,1,2018,12,6,December,Thursday,3
997,2019-05-07,487,26,14,2019,5,7,May,Tuesday,1
998,2019-03-03,1503,21,2,2019,3,3,March,Sunday,6
999,2019-10-15,6371,7,22,2019,10,15,October,Tuesday,1

In [28]:
date['is_weekend'] = np.where(date.day_name.isin(['Sunday','Saturday']),1,0)

In [29]:
date

,date,product_id,city_id,orders,year,month,day,month_name,day_name,day_of_week,is_weekend
0,2019-12-10,5628,25,3,2019,12,10,December,Tuesday,1,0
1,2018-08-15,3646,14,157,2018,8,15,August,Wednesday,2,0
2,2018-10-23,1859,25,1,2018,10,23,October,Tuesday,1,0
3,2019-08-17,7292,25,1,2019,8,17,August,Saturday,5,1
4,2019-01-06,4344,25,3,2019,1,6,January,Sunday,6,1
...,...,...,...,...,...,...,...,...,...,...,...
995,2018-10-08,255,13,1,2018,10,8,October,Monday,0,0
996,2018-12-06,5521,7,1,2018,12,6,December,Thursday,3,0
997,2019-05-07,487,26,14,2019,5,7,May,Tuesday,1,0
998,2019-03-03,1503,21,2,2019,3,3,March,Sunday,6,1
999,2019-10-15,6371,7,22,2019,10,15,October,Tuesday,1,0

In [31]:
date['quarter'] = date.date.dt.quarter

In [32]:
date

,date,product_id,city_id,orders,year,month,day,month_name,day_name,day_of_week,is_weekend,quarter
0,2019-12-10,5628,25,3,2019,12,10,December,Tuesday,1,0,4
1,2018-08-15,3646,14,157,2018,8,15,August,Wednesday,2,0,3
2,2018-10-23,1859,25,1,2018,10,23,October,Tuesday,1,0,4
3,2019-08-17,7292,25,1,2019,8,17,August,Saturday,5,1,3
4,2019-01-06,4344,25,3,2019,1,6,January,Sunday,6,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...
995,2018-10-08,255,13,1,2018,10,8,October,Monday,0,0,4
996,2018-12-06,5521,7,1,2018,12,6,December,Thursday,3,0,4
997,2019-05-07,487,26,14,2019,5,7,May,Tuesday,1,0,2
998,2019-03-03,1503,21,2,2019,3,3,March,Sunday,6,1,1
999,2019-10-15,6371,7,22,2019,10,15,October,Tuesday,1,0,4

In [34]:
date['semester'] = np.where(date.quarter.isin([1,2]),1,2)

In [35]:
date

,date,product_id,city_id,orders,year,month,day,month_name,day_name,day_of_week,is_weekend,quarter,semester
0,2019-12-10,5628,25,3,2019,12,10,December,Tuesday,1,0,4,2
1,2018-08-15,3646,14,157,2018,8,15,August,Wednesday,2,0,3,2
2,2018-10-23,1859,25,1,2018,10,23,October,Tuesday,1,0,4,2
3,2019-08-17,7292,25,1,2019,8,17,August,Saturday,5,1,3,2
4,2019-01-06,4344,25,3,2019,1,6,January,Sunday,6,1,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,2018-10-08,255,13,1,2018,10,8,October,Monday,0,0,4,2
996,2018-12-06,5521,7,1,2018,12,6,December,Thursday,3,0,4,2
997,2019-05-07,487,26,14,2019,5,7,May,Tuesday,1,0,2,1
998,2019-03-03,1503,21,2,2019,3,3,March,Sunday,6,1,1,1
999,2019-10-15,6371,7,22,2019,10,15,October,Tuesday,1,0,4,2

In [37]:
import datetime as ddt

In [38]:
today  = ddt.datetime.today()

In [39]:
today

datetime.datetime(2026, 2, 13, 1, 5, 59, 861721)

In [40]:
today - date.date

0     2257 days 01:05:59.861721
1     2739 days 01:05:59.861721
2     2670 days 01:05:59.861721
3     2372 days 01:05:59.861721
4     2595 days 01:05:59.861721
                 ...
995   2685 days 01:05:59.861721
996   2626 days 01:05:59.861721
997   2474 days 01:05:59.861721
998   2539 days 01:05:59.861721
999   2313 days 01:05:59.861721
Name: date, Length: 1000, dtype: timedelta64[ns]

In [44]:
(today - date.date).dt.days

0      2257
1      2739
2      2670
3      2372
4      2595
       ...
995    2685
996    2626
997    2474
998    2539
999    2313
Name: date, Length: 1000, dtype: int64

TIME

In [46]:
time

                    date                                                msg
0    2013-12-15 00:50:00                           ищу на сегодня мужика 37
1    2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2    2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3    2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4    2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше
..                   ...                                                ...
995  2012-03-16 00:50:00     ПАРЕНЬ СДЕЛАЕТ  МАССАЖ ЖЕНЩИНАМ -066-877-32-44
996  2014-01-23 23:14:00            сельский п 23 ищу девушку для отношений
997  2012-10-15 23:37:00  Д+Д ДЛЯ серьезных отношений. Мой номер 093-156...
998  2012-06-21 23:34:00  7 ДНЕПР М.34 ПОЗ.С Д/Ж ДЛЯ ВСТРЕЧ.Т.098 809 15 14
999  2014-06-19 23:25:00          Парень поласкает девушке...  т.0662035584

[1000 rows x 2 columns]

In [49]:
time.drop(columns='msg',inplace=True)

In [50]:
time

                    date
0    2013-12-15 00:50:00
1    2014-04-29 23:40:00
2    2012-12-30 00:21:00
3    2014-11-28 00:31:00
4    2013-10-26 23:11:00
..                   ...
995  2012-03-16 00:50:00
996  2014-01-23 23:14:00
997  2012-10-15 23:37:00
998  2012-06-21 23:34:00
999  2014-06-19 23:25:00

[1000 rows x 1 columns]

In [51]:
time.date  = pd.to_datetime(time.date)

In [52]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 7.9 KB

In [53]:
time['hour'] = time.date.dt.hour

In [54]:
time['second']= time.date.dt.second

In [55]:
time

                   date  hour  second
0   2013-12-15 00:50:00     0       0
1   2014-04-29 23:40:00    23       0
2   2012-12-30 00:21:00     0       0
3   2014-11-28 00:31:00     0       0
4   2013-10-26 23:11:00    23       0
..                  ...   ...     ...
995 2012-03-16 00:50:00     0       0
996 2014-01-23 23:14:00    23       0
997 2012-10-15 23:37:00    23       0
998 2012-06-21 23:34:00    23       0
999 2014-06-19 23:25:00    23       0

[1000 rows x 3 columns]

In [56]:
time['minute'] = time.date.dt.minute

In [57]:
time['time'] = time.date.dt.time

In [58]:
time

                   date  hour  second  minute      time
0   2013-12-15 00:50:00     0       0      50  00:50:00
1   2014-04-29 23:40:00    23       0      40  23:40:00
2   2012-12-30 00:21:00     0       0      21  00:21:00
3   2014-11-28 00:31:00     0       0      31  00:31:00
4   2013-10-26 23:11:00    23       0      11  23:11:00
..                  ...   ...     ...     ...       ...
995 2012-03-16 00:50:00     0       0      50  00:50:00
996 2014-01-23 23:14:00    23       0      14  23:14:00
997 2012-10-15 23:37:00    23       0      37  23:37:00
998 2012-06-21 23:34:00    23       0      34  23:34:00
999 2014-06-19 23:25:00    23       0      25  23:25:00

[1000 rows x 5 columns]

In [59]:
today - time.date

0     4443 days 00:15:59.861721
1     4307 days 01:25:59.861721
2     4793 days 00:44:59.861721
3     4095 days 00:34:59.861721
4     4492 days 01:54:59.861721
                 ...
995   5082 days 00:15:59.861721
996   4403 days 01:51:59.861721
997   4868 days 01:28:59.861721
998   4984 days 01:31:59.861721
999   4256 days 01:40:59.861721
Name: date, Length: 1000, dtype: timedelta64[ns]

In [60]:
(today - time['date'])/np.timedelta64(1,'s')

0      3.838762e+08
1      3.721300e+08
2      4.141179e+08
3      3.538101e+08
4      3.881157e+08
           ...
995    4.390858e+08
996    3.804259e+08
997    4.206005e+08
998    4.306231e+08
999    3.677245e+08
Name: date, Length: 1000, dtype: float64

In [61]:
(today - time['date'])/np.timedelta64(1,'m')

0      6.397936e+06
1      6.202166e+06
2      6.901965e+06
3      5.896835e+06
4      6.468595e+06
           ...
995    7.318096e+06
996    6.340432e+06
997    7.010009e+06
998    7.177052e+06
999    6.128741e+06
Name: date, Length: 1000, dtype: float64

In [62]:
(today - time['date'])/np.timedelta64(1,'h')

0      106632.266628
1      103369.433295
2      115032.749962
3       98280.583295
4      107809.916628
           ...
995    121968.266628
996    105673.866628
997    116833.483295
998    119617.533295
999    102145.683295
Name: date, Length: 1000, dtype: float64

In [63]:
time

                   date  hour  second  minute      time
0   2013-12-15 00:50:00     0       0      50  00:50:00
1   2014-04-29 23:40:00    23       0      40  23:40:00
2   2012-12-30 00:21:00     0       0      21  00:21:00
3   2014-11-28 00:31:00     0       0      31  00:31:00
4   2013-10-26 23:11:00    23       0      11  23:11:00
..                  ...   ...     ...     ...       ...
995 2012-03-16 00:50:00     0       0      50  00:50:00
996 2014-01-23 23:14:00    23       0      14  23:14:00
997 2012-10-15 23:37:00    23       0      37  23:37:00
998 2012-06-21 23:34:00    23       0      34  23:34:00
999 2014-06-19 23:25:00    23       0      25  23:25:00

[1000 rows x 5 columns]